# encoding: utf-8

module K2J
  module Map
    KEY = ['ㅁ', 'ㅠ', 'ㅊ', 'ㅇ', 'ㄷ', 'ㄹ', 'ㅎ', 'ㅗ', 'ㅑ', 'ㅓ', 'ㅏ', 'ㅣ', 'ㅡ', 'ㅜ', 'ㅐ', 'ㅔ', 'ㅂ', 'ㄱ', 'ㄴ', 'ㅅ', 'ㅕ', 'ㅍ', 'ㅈ', 'ㅌ', 'ㅛ', 'ㅋ']
    CHO = ["아", "카까", "가", "사", "자", "타차짜따", "다", "나", "하", "바", "파빠", "마", "라"]
    JOONG = ["아", "이", "우으", "에", "오", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "야", "유", "요"]
    JONG =  ["안앙암", "앗앚앋앛압악"]
    HIRAGANA = [
          "あ", "い", "う", "え", "お", "ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "や", "ゆ", "よ", 
          "か", "き", "く", "け", "こ", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "きゃ", "きゅ", "きょ", 
          "が", "ぎ", "ぐ", "げ", "ご", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "ぎゃ", "ぎゅ", "ぎょ", 
          "さ", "し", "す", "せ", "そ", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "しゃ", "しゅ", "しょ", 
          "ざ", "じ", "ず", "ぜ", "ぞ", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "じゃ", "じゅ", "じょ", 
          "た", "ち", "つ", "て", "と", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "ちゃ", "ちゅ", "ちょ", 
          "だ", "ぢ", "づ", "で", "ど", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "ぢゃ", "ぢゅ", "ぢょ", 
          "な", "に", "ぬ", "ね", "の", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "にゃ", "にゅ", "にょ", 
          "は", "ひ", "ふ", "へ", "ほ", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "ひゃ", "ひゅ", "ひょ", 
          "ば", "び", "ぶ", "べ", "ぼ", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "びゃ", "びゅ", "びょ", 
          "ぱ", "ぴ", "ぷ", "ぺ", "ぽ", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "ぴゃ", "ぴゅ", "ぴょ", 
          "ま", "み", "む", "め", "も", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "みゃ", "みゅ", "みょ", 
          "ら", "り", "る", "れ", "ろ", "ｘ", "ｘ", "ｘ", "ｘ", "ｘ", "りゃ", "りゅ", "りょ"]

    def cho(a)
      r = ((a[0].ord - 44032) / 28) / 21
      (r + 4352).chr(Encoding::UTF_8)
    end

    def joong(a)
      r = ((a[0].ord - 44032) / 28) % 21
      (r + 4449).chr(Encoding::UTF_8)
    end

    def jong(a)
      r = (a[0].ord - 44032) % 28
      (r + 4520 - 1).chr(Encoding::UTF_8)
    end

    module_function :cho, :joong, :jong
  end
end
